In [1]:
import pandas as pd
import matplotlib as plt
import seaborn as sns

C:\Users\mattx\anaconda3\lib\site-packages\scipy\__init__.py:155: UserWarning: A NumPy version >=1.18.5 and <1.25.0 is required for this version of SciPy (detected version 1.26.4
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

## Pre Migration Analysis
We will begin by analyzing elements of the data in order to later compare with the migrated data in databricks

In [6]:
# read data
df = pd.read_csv("banking_transactions_data.csv")
df

,TRANSACTION_ID,CUSTOMER_ID,DATE_BIRTH,GENDER,CUST_LOCATION,ACCOUNT_BALANCE,TRANSACTION_DATE,TRANSACTION_TIME,TRANSACTION_AMOUNT
0,T244,C4531588,93-10-31,F,DELHI,2257.58,16-10-21,145417,460.00
1,T245,C5528968,00-01-01,M,PIPARIYA,5724.50,16-10-21,145424,4478.00
2,T246,C4814390,71-10-01,F,MIRA ROAD E,78122.46,16-10-21,150436,47290.00
3,T247,C6437438,83-05-22,F,BHUBANESHWAR,324551.50,16-10-21,151154,25000.00
4,T248,C8738676,00-01-01,M,RAJPURA,362200.72,16-10-21,151251,53000.00
...,...,...,...,...,...,...,...,...,...
249995,T246143,C6562053,88-10-03,M,DELHI,48564.43,16-08-07,221311,220.00
249996,T246144,C3571171,87-07-04,F,NAVI MUMBAI,6319.68,16-08-07,212039,1452.46
249997,T246145,C3727875,88-11-01,F,HOSHIARPUR,13431.08,16-08-07,212046,347.50
249998,T246146,C3929118,99-08-19,M,AURANGABAD,18897.50,16-08-07,212046,875.00
249999,T246147,C1180490,91-01-04,M,AHMEDABAD,124353.95,16-08-07,212146,406.00

In [7]:
# how many entries and features
df.shape

(250000, 9)

In [8]:
# Show all features in the dataset 
df.columns

Index(['TRANSACTION_ID', 'CUSTOMER_ID', 'DATE_BIRTH', 'GENDER',
       'CUST_LOCATION', 'ACCOUNT_BALANCE', 'TRANSACTION_DATE',
       'TRANSACTION_TIME', 'TRANSACTION_AMOUNT'],
      dtype='object')

In [17]:
# Show how many entries in top 5 cities
df["CUST_LOCATION"].value_counts()[:5]

MUMBAI       24631
BANGALORE    20346
NEW DELHI    20090
GURGAON      17716
DELHI        16732
Name: CUST_LOCATION, dtype: int64

In [19]:
# Find average account balance
df["ACCOUNT_BALANCE"].mean()

109716.91431539113

In [21]:
# Find total amount spent
df["TRANSACTION_AMOUNT"].sum()

400237664.81

In [29]:
# how many male customers had an account balance of less than 2000
df.query("ACCOUNT_BALANCE < 2000 and GENDER == 'M'").shape[0]

32477

In [32]:
# What customer ID is associated with Transaction ID T246143
df.query("TRANSACTION_ID == 'T246143'")["CUSTOMER_ID"]

249995    C6562053
Name: CUSTOMER_ID, dtype: object